mtosi1.1-TestSuite/TestsDefinitions/InventoryRetrieval/examples/InventoryRetrieval_getInventory1_arr.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns="tmf854.v1" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="tmf854.v1 ../../../../xsd/common/Header.xsd tmf854.v1 ../../../../xsd/interfaces/InventoryRetrieval.xsd http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Header>
		<header tmf854Version="1.1">
			<activityName>getInventory</activityName>
			<msgName>getInventory</msgName>
			<msgType>REQUEST</msgType>
			<correlationId>0001</correlationId>
			<senderURI>/MTOSI/InventoryOS</senderURI>
			<destinationURI>/MTOSI/EMS01</destinationURI>
			<communicationPattern>SimpleResponse</communicationPattern>
			<communicationStyle>MSG</communicationStyle>
			<timestamp>20051004140305</timestamp>
		</header>
	</soap:Header>
	<soap:Body>
		<getInventory tmf854Version="1.1">
			<filter>
				<baseInstance>
					<mdNm>Networks/XdrEMS/Server1</mdNm>
				</baseInstance>
				<includedObjectType>
					<objectType>ME</objectType>
					<granularity>FULL</granularity>
				</includedObjectType>
				<includedObjectType>
					<objectType>EH</objectType>
					<granularity>FULL</granularity>
				</includedObjectType>
				<includedObjectType>
					<objectType>PTP</objectType>
					<granularity>FULL</granularity>
				</includedObjectType>
			</filter>
		</getInventory>
	</soap:Body>
</soap:Envelope>
